using System;
using System.Linq;
using CourseWork.Models.Tables;

namespace CourseWork.Models
{
    public static class DatabaseInitializer
    {
        private static readonly Random Random = new Random(111);

        public static void Initialize(RestarauntDbContext db)
        {
            db.Database.EnsureCreated();
            GenerateEmployees(db);
            GenerateCustomers(db);
            GenerateProviders(db);
            GenerateIngredients(db);
            GenerateOrders(db);
            GenerateDishes(db);
            GenerateDishIngredients(db);
        }

        private static void GenerateEmployees(RestarauntDbContext db)
        {
            if (db.Employees.Any()) return;

            db.Employees.AddRange(
                new Employee
                {
                    Surname = "Блинов",
                    Name = "Александр",
                    MiddleName = "Львович",
                    Education = "ГГТУ им. П.О.Сухого",
                    Position = "Менеджер",
                    PhoneNumber = "+375299331233"
                },
                new Employee
                {
                    Surname = "Михеев",
                    Name = "Антон",
                    MiddleName = "Тихонович",
                    Education = "ГГТУ им. П.О.Сухого",
                    Position = "Менеджер",
                    PhoneNumber = "+375297599232"
                },
                new Employee
                {
                    Surname = "Осипова",
                    Name = "Дарья",
                    MiddleName = "Владимировна",
                    Education = "ГГУ им. Франциска Скорины",
                    Position = "Администратор",
                    PhoneNumber = "+375449937687"
                },
                new Employee
                {
                    Surname = "Киселева",
                    Name = "Алёна",
                    MiddleName = "Григорьевна",
                    Education = "ГГУ им. Франциска Скорины",
                    Position = "Менеджер по закупкам",
                    PhoneNumber = "+375448849101"
                },
                new Employee
                {
                    Surname = "Григорьев",
                    Name = "Алексей",
                    MiddleName = "Артёмович",
                    Education = "ГГУ им. Франциска Скорины",
                    Position = "HR-специалист",
                    PhoneNumber = "+37544940222"
                },
                new Employee
                {
                    Surname = "Елисеев",
                    Name = "Семён",
                    MiddleName = "Григорьевич",
                    Education = "БГУ",
                    Position = "PR-менеджер",
                    PhoneNumber = "+375294490362"
                },
                new Employee
                {
                    Surname = "Миронова",
                    Name = "Василиса",
                    MiddleName = "Марковна",
                    Education = "БГУ",
                    Position = "Шеф-повар",
                    PhoneNumber = "+375299928831"
                },
                new Employee
                {
                    Surname = "Поляков",
                    Name = "Алексей",
                    MiddleName = "Никитич",
                    Education = "Гомельский ГПТК К",
                    Position = "Повар-кондитер",
                    PhoneNumber = "+375294344456"
                },
                new Employee
                {
                    Surname = "Александрова",
                    Name = "Ульяна",
                    MiddleName = "Ярославовна",
                    Education = "Гомельский ГПТК К",
                    Position = "Шеф-повар",
                    PhoneNumber = "+375338592243"
                },
                new Employee
                {
                    Surname = "Иванов",
                    Name = "Павел",
                    MiddleName = "Степанович",
                    Education = "Гомельский ГПТК К",
                    Position = "Повар",
                    PhoneNumber = "+375335562312"
                },
                new Employee
                {
                    Surname = "Хохлов",
                    Name = "Дмитрий",
                    MiddleName = "Степанович",
                    Education = "БНТУ",
                    Position = "Официант",
                    PhoneNumber = "+375254034042"
                },
                new Employee
                {
                    Surname = "Наумов",
                    Name = "Матвей",
                    MiddleName = "Никитич",
                    Education = "БГТУ",
                    Position = "Официант",
                    PhoneNumber = "+375293320930"
                },
                new Employee
                {
                    Surname = "Комарова",
                    Name = "Полина",
                    MiddleName = "Фёдоровна",
                    Education = "МГПК",
                    Position = "Кассир",
                    PhoneNumber = "+375296577755"
                },
                new Employee
                {
                    Surname = "Никитина",
                    Name = "Маргарита",
                    MiddleName = "Тимуровна",
                    Education = "БТЭУ",
                    Position = "Директор",
                    PhoneNumber = "+375297877822"
                },
                new Employee
                {
                    Surname = "Маслов",
                    Name = "Максим",
                    MiddleName = "Фёдорович",
                    Education = "БТЭУ",
                    Position = "Заместитель директора",
                    PhoneNumber = "+375445889820"
                });
            db.SaveChanges();
        }

        private static void GenerateCustomers(RestarauntDbContext db)
        {
            if (db.Customers.Any()) return;

            db.Customers.AddRange(
                new Customer
                {
                    Surname = "Сафонов",
                    Name = "Дмитрий",
                    MiddleName = "Дмитриевич",
                    PhoneNumber = "+375443443322"
                },
                new Customer
                {
                    Surname = "Родионов",
                    Name = "Леонид",
                    MiddleName = "Маркович",
                    PhoneNumber = "+375339290481"
                },
                new Customer
                {
                    Surname = "Борисов",
                    Name = "Адам",
                    MiddleName = "Максимович",
                    PhoneNumber = "+375331123324"
                },
                new Customer
                {
                    Surname = "Маркова",
                    Name = "Фатима",
                    MiddleName = "Григорьевна",
                    PhoneNumber = "+375334432433"
                },
                new Customer
                {
                    Surname = "Марков",
                    Name = "Роман",
                    MiddleName = "Максимович",
                    PhoneNumber = "+375332572848"
                },
                new Customer
                {
                    Surname = "Панина",
                    Name = "Екатерина",
                    MiddleName = "Денисовна",
                    PhoneNumber = "+375338839928"
                },
                new Customer
                {
                    Surname = "Родина",
                    Name = "Милана",
                    MiddleName = "Денисовна",
                    PhoneNumber = "+375255663434"
                },
                new Customer
                {
                    Surname = "Иванова",
                    Name = "Анна",
                    MiddleName = "Антоновна",
                    PhoneNumber = "+375446678891"
                },
                new Customer
                {
                    Surname = "Кондратов",
                    Name = "Антон",
                    MiddleName = "Сергеевич",
                    PhoneNumber = "+375445463412"
                },
                new Customer
                {
                    Surname = "Романов",
                    Name = "Олег",
                    MiddleName = "Никитич",
                    PhoneNumber = "+375445611234"
                },
                new Customer
                {
                    Surname = "Фирсова",
                    Name = "Ксения",
                    MiddleName = "Максимовна",
                    PhoneNumber = "+375449369285"
                },
                new Customer
                {
                    Surname = "Егорова",
                    Name = "Алиса",
                    MiddleName = "Владимировна",
                    PhoneNumber = "+375444568789"
                },
                new Customer
                {
                    Surname = "Нестерова",
                    Name = "Антонина",
                    MiddleName = "Станиславовна",
                    PhoneNumber = "+375448768981"
                });
            db.SaveChanges();
        }

        private static void GenerateProviders(RestarauntDbContext db)
        {
            if (db.Providers.Any()) return;

            db.Providers.AddRange(
                new Provider
                {
                    Name = "Кофейная лавка",
                    Address = "Гродненская область, Волковыск, ул. Панковой, 58",
                    PhoneNumber = "+375446783232"
                },
                new Provider
                {
                    Name = "Рыбсеть",
                    Address = "Гродненская область, Гродно, ул. Ожешко, 49",
                    PhoneNumber = "+375442677853"
                },
                new Provider
                {
                    Name = "60 зёрен",
                    Address = "Гродненская область, Гродно, ул. Клецкова, 8",
                    PhoneNumber = "+375448723688"
                },
                new Provider
                {
                    Name = "Мясной король",
                    Address = "Брестская область, Брест, ул. Луцкая, 55",
                    PhoneNumber = "+375448723688"
                },
                new Provider
                {
                    Name = "Кубанская Кормилица",
                    Address = "Минская область, Минск, ул. Городской Вал, 9",
                    PhoneNumber = "+375447680033"
                },
                new Provider
                {
                    Name = "Моцарелла",
                    Address = "Брестская область, Брест, ул. Карла Маркса, 18",
                    PhoneNumber = "+375444668266"
                },
                new Provider
                {
                    Name = "Жимолость",
                    Address = "Минская область, Бобруйск, ул. Шаранговича, 72",
                    PhoneNumber = "+37544679284"
                },
                new Provider
                {
                    Name = "Братья Грим",
                    Address = "Брестская область, Пинск, ул. Первомайская, 101",
                    PhoneNumber = "+375449470281"
                },
                new Provider
                {
                    Name = "Золотой ключик",
                    Address = "Гомельская область, Мозырь, ул. Студенческая, 12",
                    PhoneNumber = "+375446172803"
                },
                new Provider
                {
                    Name = "Буренка",
                    Address = "Гродненская область, Волковыск, ул. 8 марта, 53",
                    PhoneNumber = "+375449301293"
                },
                new Provider
                {
                    Name = "Красная Заря",
                    Address = "Могилёвская область, Могилёв, ул. Бодина, 7",
                    PhoneNumber = "+375446068309"
                });
            db.SaveChanges();
        }

        private static void GenerateIngredients(RestarauntDbContext db)
        {
            if (db.Ingredients.Any()) return;

            string[] names =
            {
                "Бобы", "Булгур", "Геркулес", "Гречневая крупа", "Гречневая мука", "Дикий рис", "Какао", "Камут",
                "Киноа", "Кукурузная мука", "Кускус", "Льняная мука", "Манная крупа", "Мука из киноа",
                "Натуральный кофе", "Нут", "Овсяная крупа", "Отруби", "Перловая крупа", "Полба", "Пшеничная крупа",
                "Пшеничная мука", "Пшено", "Ржаная крупа", "Рис", "Рисовая мука", "Саго", "Фасоль", "Чечевица",
                "Шоколад", "Ячмень", "Nutella", "Агар-агар", "Аджика", "Арахисовое масло", "Аргановое масло", "Аррорут",
                "Бальзамический уксус", "Варенье", "Водоросли", "Вустерширский соус", "Горчица", "Горчичное масло",
                "Джем", "Желатин", "Заменитель яиц", "Изюм", "Имбирное масло", "Кетчуп", "Кислота лимонная",
                "Кленовый сироп", "Клетчатка", "Кокосовое масло", "Кокосовое молоко", "Кондитерские украшения",
                "Конопляное масло", "Конфеты", "Конфитюр", "Коптильная жидкость", "Крахмал", "Кукурузное масло",
                "Кунжутное масло", "Лапша", "Майонез", "Марципан", "Масло авокадо", "Масло для фритюра",
                "Масло из виноградных косточек", "Масло канолы", "Масло тмина", "Мед", "Миндальное масло", "Мюсли",
                "Ньокки", "Оливковое масло", "Ореховое масло", "Панировочные сухари", "Паста", "Паста анко", "Пектин",
                "Пищевой краситель", "Повидло", "Помидоры в собственном соку", "Растительное масло",
                "Растительные сливки", "Рафинированное масло", "Рисовый уксус", "Рыбный соус", "Сахар", "Свежие дрожжи",
                "Сладкий соус чили", "Соевое масло", "Соевое молоко", "Соевый соус", "Соус наршараб", "Соус табаско",
                "Соус тако", "Соус терияки", "Соус чили с чесноком", "Тапиока", "Темпура микс", "Томатная паста",
                "Томатный соус пассата", "Тофу", "Анчоусы", "Барабулька", "Баррамунди", "Белая акула", "Белуга",
                "Голец", "Горбуша", "Гребешки", "Дорадо", "Икра", "Кальмары", "Камбала", "Каракатица", "Карась", "Карп",
                "Кефаль", "Килька", "Крабы", "Лангуст", "Лангустины", "Лобстер", "Лосось", "Макрель", "Мидии", "Миноги",
                "Минтай", "Мойва", "Моллюски", "Морской лещ", "Морской язык", "Окунь", "Осетрина", "Осьминог", "Палтус",
                "Раки", "Ракушки-венерки", "Сазан", "Сайда", "Сардины", "Севрюга", "Сельдь", "Семга", "Сибас",
                "Скумбрия", "Сом", "Сушеные снетки", "Треска", "Тунец", "Угорь", "Филе ската", "Форель", "Щука",
                "Адинамодо", "Белый перец горошком", "Бульонный кубик", "Ваниль", "Васаби", "Гвоздика",
                "Длинный черный перец", "Зеленый перец горошком", "Кардамон", "Карри",
                "Китайские пряности 'Пять специй'", "Корица", "Кунжутные семечки", "Куркума", "Мак", "Масала",
                "Паприка", "Пекарский порошок", "Пряности", "Розовый перец", "Салатная заправка", "Семена горчицы",
                "Семена кориандра", "Семечки подсолнуха", "Смесь 'Четыре специи'", "Смесь итальянских трав",
                "Смесь перцев", "Соль", "Соус хойсин", "Сушеный перец чили", "Сычуаньский перец", "Тандури",
                "Черный душистый перец", "Черный перец горошком", "Шафран", "Абсент", "Ангостура", "Арак", "Арманьяк",
                "Бальзам", "Бренди", "Бурбон", "Вермут", "Вино", "Виски", "Граппа", "Имбирное зеленое вино", "Кава",
                "Кагор", "Кальвадос", "Кашаса", "Коньяк", "Ламбруско", "Мадера", "Марсала", "Мартини", "Мускат",
                "Оранж биттер", "Пастис", "Перно", "Портвейн", "Ром", "Рутбир", "Саке", "Самбука", "Сидр", "Херес",
                "Йогурт", "Кварк", "Кефир", "Куриное яйцо", "Маргарин", "Молоко", "Мороженое", "Обезжиренный творог",
                "Пахта", "Перепелиное яйцо", "Простокваша", "Ряженка", "Сгущенное молоко", "Сливки", "Сливочное масло",
                "Сметана", "Творог", "Утиное яйцо", "Адыгейский сыр", "Голландский сыр", "Голубой сыр", "Зеленый сыр",
                "Козий сыр", "Овечий сыр", "Пошехонский сыр", "Российский сыр", "Сливочный сыр", "Сыр асьяго",
                "Сыр базирон песто", "Сыр банон", "Сыр брынза", "Сыр буррата", "Сыр гауда", "Сыр грана-падано",
                "Сыр дабл глостер", "Сыр дор-блю", "Сыр камамбер", "Сыр маскарпоне", "Сыр моцарелла", "Сыр надуги",
                "Сыр пармезан", "Сыр пекорино романо", "Сыр рокфор", "Сыр фета", "Сыр фетакса", "Сыр филадельфия",
                "Сыр халуми", "Сыр чеддер", "Сыр эдам", "Сырная косичка", "Швейцарский сыр", "Шоколадный сыр",
                "Артишоки", "Баклажаны", "Бамия", "Батат", "Белокочанная капуста", "Брюква", "Брюссельская капуста",
                "Галангал", "Горох", "Зеленый горошек", "Имбирь", "Кабачки", "Кайенский перец", "Каперсы", "Капуста",
                "Капуста брокколи", "Капуста романеско", "Картофель", "Китайская капуста", "Кольраби",
                "Консервированный перец пименто", "Корень куркумы", "Краснокочанная капуста", "Красный лук", "Крачай",
                "Лук-порей", "Лук-шалот", "Маринованные огурцы", "Маслины", "Морковь", "Огурцы", "Оливки",
                "Пальчиковые помидоры", "Пастернак", "Патиссоны", "Перец чили", "Помидоры черри", "Ревень", "Редис",
                "Редька", "Репа", "Репчатый лук", "Савойская капуста", "Свежая кукуруза", "Свежий перец", "Свекла",
                "Сельдерей", "Сладкий перец", "Спаржа", "Стручковая фасоль", "Топинамбур", "Тыква", "Фенхель", "Хрен",
                "Цветная капуста", "Цукини", "Чеснок", "Гусь", "Индейка", "Курица", "Перепелка", "Утка", "Фуа-гра",
                "Цесарка", "Цыпленок", "Бекон", "Ветчина", "Говядина", "Заяц", "Колбаса", "Колбаски", "Кролик", "Мясо",
                "Сардельки", "Свинина", "Сервелат", "Сосиски", "Телятина", "Фарш", "Белые грибы", "Вешенки",
                "Грибы шиитаке", "Грибы эноки", "Лисички", "Маслята", "Опята", "Подберёзовики", "Рыжики", "Сморчки",
                "Сухие китайские грибы", "Трюфели", "Шампиньоны", "Абрикосовое пюре", "Абрикосы", "Авокадо", "Айва",
                "Ананас", "Апельсины", "Арбуз", "Банановое пюре", "Бананы", "Барбарис", "Брусника", "Виноград", "Вишня",
                "Голубика", "Гранаты", "Грейпфруты", "Груши", "Дыня", "Ежевика", "Земляника", "Инжир", "Карамбола",
                "Киви", "Кизил", "Клубника", "Клюква", "Крыжовник", "Кумкват", "Лайм", "Лимон", "Личи", "Малина",
                "Манго", "Мандарины", "Маракуйя", "Морошка", "Мушмула", "Нектарины", "Облепиха", "Папайя", "Персики",
                "Помело", "Рябина", "Сливы", "Смородина", "Танжело", "Фейхоа", "Финики", "Хурма", "Черника",
                "Чернослив", "Яблоко"
            };

            var providersCount = db.Providers.Count();

            foreach (var name in names)
                db.Add(new Ingredient
                {
                    Name = name,
                    ReleaseDate = GenerateRandomDate(),
                    Count = Random.Next(5, 200),
                    Cost = Random.NextDouble() * 100.0 + 0.01,
                    ExpirationDate = Random.Next(1, 5 * 365),
                    ProviderId = Random.Next(1, providersCount)
                });

            db.SaveChanges();
        }

        private static void GenerateOrders(RestarauntDbContext db)
        {
            if (db.Orders.Any()) return;

            const int count = 500;
            var customersCount = db.Customers.Count();
            var employeesCount = db.Employees.Count();

            for (var i = 0; i < count; i++)
                db.Add(new Order
                {
                    Date = GenerateRandomDate(),
                    Time = new DateTime(1, 1, 1, Random.Next(24), Random.Next(60), Random.Next(60)),
                    Cost = (Random.NextDouble() + 0.01) * 1000.0,
                    Payment = Random.Next() % 2 == 0 ? Order.PaymentType.Cash : Order.PaymentType.CreditCard,
                    Completed = Random.Next() % 2 == 0,
                    CustomerId = Random.Next(1, customersCount),
                    EmployeeId = Random.Next(1, employeesCount)
                });

            db.SaveChanges();
        }

        private static void GenerateDishes(RestarauntDbContext db)
        {
            if (db.Dishes.Any()) return;

            string[] names =
            {
                "Абон", "Авголемоно", "Агуапанела", "Аджика", "Адобо", "Азу", "Айвар", "Айвовый мармелад", "Айнтопф",
                "Айоли", "Айсбайн", "Аквакотта", "Акутак", "Алани", "Алйотта", "Аль пастор", "Аманатто", "Амаретто",
                "Аматричана", "Амич", "Аммицу", "Ампо", "Ан-пан", "Ангулас", "Андуйет", "Антипасто", "Антрекот",
                "Аодзиру", "Аранчини", "Арахисовый соус", "Арем-арем", "Арепа", "Аришта", "Аррабиата", "Асадо", "Асида",
                "Асорда", "Атала", "Афарар", "Афганское печенье", "Афелия", "Ахар-ховла", "Ахи", "Ахобланко", "Ачар",
                "Ачма", "Ашлян-фу", "Ашуре", "Баар", "Бабка", "Багардж", "Багрир", "Бадамбура", "Бадриджани",
                "Байоннская ветчина", "Бакербзе", "Баклажанная икра", "Баксо", "Баладо", "Балокумья", "Балют", "Бамба",
                "Бамбергские луковицы", "Банановый торт", "Банановый фостер", "Баница", "Бануш", "Баньтьынг", "Баоцзы",
                "Барбекю", "Бармбрэк", "Баррига де фрейра", "Бастурма", "Батончик Mars во фритюре", "Баурсак", "Бахш",
                "Бедфордширский клэнгер", "Безе", "Бейжиньо", "Бекон в шоколаде", "Бекон с капустой",
                "Белёвская пастила", "Беляш", "Бергамотовые леденцы из Нанси", "Берлинский шницель", "Бёф бургиньон",
                "Бефстроганов", "Бешамель", "Бешбармак", "Бигос", "Билгорайский пирог", "Билтонг", "Бирвурст",
                "Биршинкен", "Бирьяни", "Биск", "Бискайский соус", "Бисквит", "Бискотто", "Бисмарк", "Биссара",
                "Биточки", "Бифштекс", "Бичак", "Блаа", "Блины", "Блонди", "Блюда из медуз", "Блюдо", "Бозбаш",
                "Бойшель", "Боквурст", "Боккончини", "Боксти", "Болонская колбаса", "Болоньезе", "Борц", "Борщ",
                "Борщ с ушками", "Босна", "Боснийский горшок", "Ботамоти", "Ботвинья", "Брауни", "Брезаола",
                "Бригадейро", "Брик", "Бриошь", "Бртуч", "Буберт", "Бублик", "Бубур-аям", "Буженина", "Буйабес",
                "Булетте", "Бунтил", "Буррито", "Бурфи", "Бутерброд", "Бутифарра", "Бэлиш", "Бюклинг", "Вагаси",
                "Вальдорфский салат", "Ванильный ростбиф", "Варабимоти", "Вареники", "Варёные колбасы", "Васаби",
                "Васанбон", "Ватербломметьибреди", "Ватрушка", "Веджибургер", "Велуте", "Венесуэльский куриный салат",
                "Венский шницель", "Вентричина", "Вергуны", "Вертута", "Ветчина", "Вильмулимуль", "Винартерта",
                "Виндалу", "Винегрет", "Винегретная заправка", "Вонтоны", "Вонючий тофу", "Вустерский соус",
                "Гавайская пицца", "Гадо-гадо", "Галантин", "Галушки", "Гамбо", "Гамбургер", "Гамбургский стейк",
                "Гаммодоки", "Гараш", "Гарзни-ховла", "Гари", "Гарум", "Гаспачо", "Гаспачуэло", "Гастрик", "Гата",
                "Гачас", "Гваймакхш", "Гепук", "Гермкнёдль", "Герцогги", "Гетцен", "Гибаница", "Гири-тёко", "Гирос",
                "Говядина Веллингтон", "Говяжьи рулетики", "Гогал", "Гоголь-моголь", "Гойябада", "Голландский соус",
                "Голубой карп", "Голубцы", "Гороховая каша", "Граавилохи", "Гренки", "Грёстль", "Гречаники (блюдо)",
                "Греческий салат", "Гречневая каша", "Гречневый суп", "Грибной соус", "Грюнколь (блюдо)", "Гуакамоле",
                "Гуанчале", "Губадия", "Гудег", "Гуди", "Гужеры", "Гулаб джамун", "Гулай", "Гуляш", "Гурка", "Гуртук",
                "Гурьевская каша", "Гювеч", "Гюдон", "Гюрза", "Гютан", "Дадих", "Далнаш", "Дамплинги", "Дампфнудель",
                "Данго", "Данди", "Датч беби", "Дахи", "Дебреценские сосиски", "Дежень", "Деман-ховла", "Демиглас",
                "Джаггери", "Джалеби", "Джамбалайя", "Джаша-мару", "Джбейна", "Джезерье", "Джелато", "Джиз-быз",
                "Джолоф", "Дзампоне", "Дзукотто", "Дзунда", "Дзыкка", "Дип", "Довга", "Додол", "Докторская колбаса",
                "Долма", "Домбури", "Дораяки", "Доса", "Дроб", "Дрочёна", "Дульсе де лече", "Дымдама", "Дынная булочка",
                "Ёкан", "Ерундопель", "Жаба в норке", "Жареная пицца", "Жареная сельдь в маринаде", "Жареное молоко",
                "Жареные кальмары", "Жареный картофель", "Жареный рис", "Жареный хлеб", "Жаркое",
                "Жаркое из капусты и картофеля", "Желе", "Желтки святого Леандра", "Желтки святой Терезы",
                "Жёлтый соевый соус", "Жемайчю блинай", "Женгялов хац", "Жент", "Женуаз", "Жижиг-галнаш", "Жижиг-чорпа",
                "Жур", "Заварной крем", "Загорские штрукли", "Заливное", "Зальцбургские клёцки", "Зама", "Запеканка",
                "Запечённая Аляска", "Зауэрбратен", "Зауэрфлайш", "Захер", "Заячье рагу", "Зельц", "Земелах", "Зразы",
                "Зуцы", "Идли", "Идра", "Идрийские жликрофи", "Икамэси", "Иль флотант", "Имагаваяки", "Имам-баялды",
                "Имони", "Ирландское рагу", "Исида", "Искушение Янсона", "Испанская тортилья", "Ишкембе чорбасы",
                "Йоулуторту", "Йох", "Йыуаса", "Кабанос", "Кабачковая икра", "Кабса", "Кадисский хлеб", "Казатьелло",
                "Кайзершмаррн", "Кайтэн-дзуси", "Какавья", "Калакейтто", "Калакукко", "Калач", "Калдейрада", "Калепаче",
                "Калитки", "Калифорния", "Кальби", "Кальбитхан", "Калья", "Камабоко", "Камамэси",
                "Камбала по-финкенвердерски", "Камберленд", "Камди-ча", "Камуния", "Канапе", "Канеле", "Као Лам",
                "Капкейк", "Капоната", "Капрезе", "Капрезе", "Капустница", "Капустные галушки", "Капустный салат",
                "Капытка", "Каравай", "Карагеоргиев шницель", "Карамельный пудинг", "Карахильо", "Карбонад",
                "Карбонара", "Каре", "Карельские пирожки", "Каринтийская лапша", "Каролина", "Карпаччо", "Карривурст",
                "Картопляники", "Картофель Анна", "Картофель в мундире", "Картофель фри", "Картофельное пюре",
                "Картофельные оладьи", "Картофельный салат", "Картулипорсс", "Карукан", "Кассёла", "Касселер",
                "Кассуле", "Кастелла", "Касу марцу", "Касуами", "Катлама", "Катого", "Каттама", "Катыкли",
                "Кауса лименья", "Кацудон", "Кацуобуси", "Качапа", "Качо э пепе", "Качопо", "Каша", "Кашанка",
                "Квашеная капуста", "Квашеные лимоны", "Кебаб", "Кеджери", "Кезекрайнер", "Кезешпецле", "Кекс-лягушка",
                "Келедош", "Келле-пача", "Кёнигсбергские клопсы", "Кёнигсбергский марципан", "Керак-телор", "Кетопрак",
                "Кетупат", "Кетчуп", "Кешкек", "Киббех", "Киевский торт", "Кимбап", "Кимчхиччигэ", "Киритампо",
                "Кисель", "Кислая требуха", "Кислые почки", "Китфо", "Кихелах", "Кичри", "Кишка", "Кишки чинёные",
                "Кленовая ириска", "Кленовый крем", "Клёцки", "Кнедлик", "Кнели", "Книперколь", "Кныш", "Кобб",
                "Коблер", "Коврижка", "Коддл", "Козули", "Козунак", "Кокосовый джем", "Коксинья", "Коктал", "Колачки",
                "Колбаса", "Колбасное изделие", "Колбасный салат", "Колбасный фарш", "Колдуны", "Колканнон", "Кололак",
                "Команмелна", "Копальхен", "Кордон блю", "Коричневый соус", "Корн-дог", "Корниш пасти", "Короккэ",
                "Косидо", "Косовский салат", "Костица", "Котекино", "Котлета", "Котлета по-киевски", "Кофе де олья",
                "Кофейное желе", "Кошари", "Краковский бублик", "Краньская колбаса", "Краснодарский соус", "Крембо",
                "Крендель", "Креплах", "Кровяная колбаса", "Кровяные блинчики", "Крок-месье", "Крокембуш", "Крокеты",
                "Кропкакор", "Кростата", "Крубинс", "Крупук", "Крылышки Буффало", "Кубане", "Кубинский сэндвич",
                "Кугелис", "Куиндим", "Куку", "Кукурузная похлёбка", "Кулага", "Кулебяка", "Кулен", "Кулеш", "Кулич",
                "Куллама", "Кульчётай", "Кундюмы", "Купаты", "Курабье", "Курабье бакинское", "Куранто", "Курзе",
                "Куриный паприкаш", "Куриный суп", "Курица по-венски", "Курица тикка масала", "Курица яннём", "Курмас",
                "Курник", "Курутоб", "Кутаб", "Кутья", "Куурдак", "Кучмачи", "Кхерзан-дулх", "Кыравец", "Кыстыбый",
                "Кысыр", "Кьопоолу", "Кюр", "Кюртёшкалач", "Кюфта", "Кюфта-бозбаш", "Лаб", "Лабскаус", "Лавангин",
                "Ладду", "Лазанки", "Лазанья", "Лаймовый пирог", "Лампредотто", "Лангет", "Ланспик", "Лапшевник",
                "Лардо", "Латкес", "Латте", "Лаулау", "Лахмаджун", "Лахох", "Лашка", "Лебервурст",
                "Лейпцигские жаворонки", "Леках", "Леманг", "Ленивые блюда", "Ленинградский", "Лёртсю",
                "Лестерширский пирог со свининой", "Лефсе", "Лечо", "Ливерная колбаса", "Лимбургский пирог", "Лимпа",
                "Лингуине", "Линцские глаза", "Лобиани", "Лобио", "Локо-моко", "Ломи сэмон", "Лонтонг", "Луканико",
                "Луканка", "Луковый клопс", "Луковый пирог", "Лукумадес", "Луссекатт", "Льежский салат",
                "Льежский сироп", "Любекский марципан", "Любительская колбаса", "Люйжоу хошао", "Люля-кебаб",
                "Лютеница", "Лютефиск", "Маамуль", "Магирица", "Мадлен", "Майнцская ветчина", "Майонез",
                "Макаронный пирог", "Макароны «по-флотски»", "Макарун", "Маклюбе", "Макмаффин", "Мактак",
                "Малагский салат", "Мамалыга", "Манджа", "Мандзю", "Манду", "Манные клёцки", "Мансаф", "Манты",
                "Манхар бланко", "Манчестерский тарт", "Маринара", "Маринованные томаты", "Мармитако", "Мартабак",
                "Масабаха", "Мастава", "Матбуха", "Матнакаш", "Мато", "Маульташены", "Мафрум", "Маффин", "Медовик",
                "Меломакарона", "Мельба", "Мельбойтель", "Месфуф", "Метт", "Мигли", "Мидии бушо", "Мизерия", "Мимоза",
                "Миндальное молоко", "Минестроне", "Мирин", "Мисосиру", "Митрайет", "Мозги ткача", "Моле", "Момо",
                "Монастырская изба", "Монблан", "Моретум", "Морковь по-корейски", "Морсилья",
                "Морсилья из Аранды-де-Дуэро", "Мортаделла", "Московит", "Мостарда", "Мофлетта", "Мохама",
                "Мочёные яблоки", "Муамба", "Муджадара", "Мужужи", "Муйыл-майы-беремэсе", "Мук", "Муль-фрит",
                "Мульгикапсад", "Муравьи взбираются на дерево", "Мусака", "Муфулетта", "Мухаллеби", "Мухаммара",
                "Мханша", "Мямми", "Мясной хлеб", "Мясо по-французски", "Наан", "Наггетсы", "Накрёпок", "Налистники",
                "Нам-прик", "Намасу", "Наполеон", "Напоритан", "Наршараб", "Нарын", "Наси-горенг", "Наси-кучинг",
                "Наси-лемак", "Натто", "Наурыз коже", "Нётаймори", "Нигири", "Никуман", "Нисуаз", "Нишалло", "Нори",
                "Ньокки", "Нэм", "Нэнмён", "Няньгао", "Няня (блюдо)", "Обацда", "Обезьяньи мозги", "Овощная икра",
                "Овощной салат", "Овсяная каша", "Огуречный суп", "Оджахури", "Одэн", "Окономияки", "Окрошка", "Оладьи",
                "Олибол", "Оливье", "Оллеброд", "Олья подрида", "Омакасэ", "Омлет", "Омурайсу", "Онигири", "Опера",
                "Опор", "Оромо", "Орчата", "Оршад", "Осетинские пироги", "Оссобуко", "Острая молния", "Отак-отак",
                "Отбивная по-милански", "Отядзукэ", "Охотничий соус", "Охотничий шницель", "Оякодон",
                "Павийские солдатики", "Пад-тай", "Пальты", "Пампушка", "Пане каразау", "Панела", "Панелла",
                "Пани ка меуза", "Пани пури", "Панини", "Панна-котта", "Панфиш", "Панцанелла", "Панчетта",
                "Папа рельена", "Папеда", "Паппа аль помодоро", "Паприкаш", "Папу-де-анжу", "Парварда", "Паровая рыба",
                "Пасанда", "Паска", "Паскуалина", "Паста алла грича", "Паста алла норма", "Паста примавера",
                "Паста с бобами", "Пастель де чокло", "Паститсио", "Пастицци", "Пастрмалия", "Пастуший пирог",
                "Пастьера", "Пасха", "Пасхальный барашек", "Пахлава", "Пачат", "Паштел-де-ната", "Паштет", "Паэлья",
                "Пекановый пирог", "Пекинская утка", "Пеламуши", "Пельмени", "Пемпек", "Пенне алла водка", "Пеперони",
                "Перкедел", "Пёркёльт", "Перловая каша", "Пероги", "Песто", "Петух в вине", "Печёночные кнели",
                "Печёные яйца", "Печёный картофель", "Печень по-берлински", "Печень по-строгановски", "Пибимпап",
                "Пивной суп", "Пиде", "Пико-де-гайо", "Пикули", "Пинджур", "Пинкель", "Пинца", "Пири-пири",
                "Пирог волхвов", "Пирог с патокой", "Пирожки с устрицами", "Пирожное Гур", "Пирожное Рунеберга",
                "Пирожок", "Писто", "Пити", "Питтипанна", "Пихельштайнер", "Пицца", "Пицца нью-йоркского стиля",
                "Пишмание", "Пища ангелов", "Пища дьявола", "Плакия", "Плацинда", "Плескавица", "Плов", "Пломбир",
                "Повидло из Тополовени", "Погача", "Подкогыльо", "Подливка", "Пожарские котлеты", "Позы", "Поке",
                "Полендвица", "Поливка", "Пондзу", "Пончик", "Попкорн", "Потофё", "Похлёбка", "Прага", "Профитроли",
                "Прошутто", "Пршут", "Пряженина", "Птитим", "Пудинг с говядиной и почками", "Пулькоги", "Пульс",
                "Пумперникель", "Пуншкрапфен", "Путра", "Путту", "Пучеро", "Пфальцский лебервурст", "Пхеньюк",
                "Пшённая каша", "Пызы", "Пьядина", "Пюре с зелёным луком", "Пянсе", "Равигот", "Рагу",
                "Рагу по-карельски", "Райндлинг", "Раки", "Раклет", "Рассольник", "Расстегай", "Рататуй", "Рахат-лукум",
                "Ревифья суп", "Регенсбургские сосиски", "Рейкялейпя", "Релиш", "Ремохон", "Ремулад", "Ренданг",
                "Рибай", "Риболлита", "Ризотто", "Рийет", "Рисаламанде", "Рисовая бумага", "Рисовая каша", "Рисолле",
                "Рича-рича", "Робатаяки", "Роджак", "Рождественский гусь", "Рождественский карп",
                "Рождественский пудинг", "Рождественский хлеб", "Рождественское полено", "Роллы", "Рольмопс", "Ромеско",
                "Ромовая баба", "Ромштекс", "Ропа вьеха", "Росолье", "Ростбиф", "Ростбиф Жирарди", "Ростбиф с луком",
                "Роте грютце", "Роти-буайя", "Рубен", "Ругелах", "Руй", "Рулет", "Рулет с маком", "Рупьмайзе",
                "Руссиш брот", "Руссишер цупфкухен", "Русская шапка", "Русские блины", "Русский соус",
                "Русское чайное печенье", "Рыба и картофель фри", "Рыба по-гречески", "Рыбная булочка",
                "Рыбная колбаса", "Рыбные шарики", "Рыбный плов", "Саксанг", "Саксонские творожники", "Саламата",
                "Саламур", "Салат из апельсинов", "Салат из говяжьих губ", "Салат из сникерса", "Салат с макаронами",
                "Салатная заправка", "Сало в шоколаде", "Сальмагунди", "Сальморехо", "Сальтимбокка", "Сальтисон",
                "Самгёпсаль", "Самоса", "Самса", "Сангрита", "Сандей", "Сантьяго", "Сарбурма", "Сарсуэла", "Сате",
                "Сацебели", "Сациви", "Сашими", "Саюр-асем", "Саюр-лоде", "Свид", "Свиное жаркое",
                "Свичкова на сметане", "Севиче", "Селёдочный салат", "Сельдь под шубой", "Семла", "Семур", "Серрадура",
                "Серранито", "Серунденг", "Сеффа", "Сиве", "Сиокара", "Сискал", "Ситинское кунжутное печенье",
                "Сицилийская пицца", "Сиченики", "Скачущий Джон", "Скиландис", "Скон", "Скордалия", "Скордоля",
                "Славинк", "Сладкие гренки", "Слатур", "Смалахове", "Смалец", "Смёрребрёд", "Сметанник", "Соан-папди",
                "Соба", "Собрасада", "Сокта", "Солянка", "Сом там", "Сосиска", "Сосиска в тесте", "Сохта", "Сочник",
                "Спагетти алио и олио", "Спагетти вонголе", "Спагетти путтанеска", "Спаржа по-фламандски",
                "Спартанская похлёбка", "Спас", "Стамппот", "Стейк", "Стейк-фри", "Столичный",
                "Сторновейский чёрный пудинг", "Страчателла", "Стриплойн", "Строганина", "Стромболи", "Стумп", "Стуфат",
                "Стью", "Субмарина-сэндвич", "Сувлаки", "Сугудай", "Суджук", "Сукалки", "Суккоташ", "Сундэ", "Суп",
                "Суп из акульих плавников", "Суп из собаки", "Суп из тануки", "Суп из шиповника", "Сурими",
                "Суссекский пудинг", "Сутэй цай", "Суфгания", "Сухари", "Суши", "Схуг", "Сырники", "Сычуаньский перец",
                "Сэкихан", "Сэмбэй", "Сэндвич", "Сэндвич с тостом", "Сюрстрёмминг", "Табуле", "Тавранчук",
                "Тавук-гёксу", "Тавче гравче", "Тайский карри", "Тайяки", "Тако", "Такояки", "Тала", "Талкан",
                "Тамагояки", "Тамале", "Тамийа", "Тандыр кавап", "Тандыр-нан", "Танов", "Тантуни", "Тапенада",
                "Тапулон", "Тарамасалата", "Таратор", "Тарт фламбе", "Тарталетка", "Тарэ", "Татаки",
                "Татарский бифштекс", "Тафельшпиц", "Творог с льняным маслом", "Текила Бум", "Террин", "Тёртый пирог",
                "Тетёры", "Тетеун", "Тефтели", "Теха", "Тикува", "Тимбалло", "Тинутуан", "Тирамису", "Тирольский шпик",
                "Тиропита", "Ткемали", "То-берам", "Токана", "Том ям", "Томатный сок", "Тонкацу", "Тонсенг",
                "Торт Реформа", "Тортеллини", "Тортеллони", "Тотхоримук", "Трдельник", "Требуха по-мадридски",
                "Три молока", "Триппа", "Трофье", "Трубочка с кремом", "Тряпичный пудинг", "Туаткал", "Тумпенг",
                "Тунцзыдань", "Тунцовый салат", "Турдакен", "Туфахия", "Тхали", "Тхуа нао", "Тыквенный пирог",
                "Тысяча островов", "Тэ-талуа", "Тэрияки", "Тюрингенская кровяная колбаса", "Тюрингенский лебервурст",
                "Тюрингенский ростбиф", "Тюря", "Тяван-муси", "Угали", "Угорь в зелёном соусе", "Удон", "Уиро", "Улюш",
                "Умас-ашы", "Унаги", "Урнебес", "Уря", "Уха", "Ушки", "Фа гао", "Фаготтини", "Фалафель", "Фалуда",
                "Фалуде", "Фарината", "Фартон", "Фаршированная колбаса", "Фаршированная рыба",
                "Фаршированные баклажаны", "Фаршированные кабачки", "Фаршированный перец", "Фасолада", "Фатаньерош",
                "Фаттуш", "Фахита", "Фенката", "Фетучини Альфредо", "Фиголла", "Филадельфия", "Филе-миньон", "Фирни",
                "Фламенкин", "Флан", "Флауна", "Флескестай", "Флип", "Флорентийский бифштекс", "Флорентини", "Фо",
                "Фокачча", "Фондю", "Форикол", "Форшмак", "Франкфуртские говяжьи колбаски", "Французский луковый суп",
                "Фрегола", "Фрикадельки", "Фрикасе", "Фриттата", "Фриттеры", "Фруктовый салат", "Фруктовый суп",
                "Фуа-гра", "Фугу", "Фузилли", "Фунтовый кекс", "Фырфыр", "Хаан", "Хаггис", "Хангикьот", "Хангири",
                "Хапама", "Хариса", "Харосет", "Харчо", "Хачапури", "Хаш", "Хашбраун", "Хаше", "Хве", "Хворост",
                "Хемадаци", "Хингалш", "Хинкал", "Хинкали", "Хияси-тюка", "Хлеб с помидором по-каталонски", "Хмисс",
                "Хойсин", "Холодец", "Холодная собака", "Холодник", "Холтмаш", "Хоменташ", "Хоммэй-тёко",
                "Хоппель-поппель", "Хоровац", "Хот-дог", "Хотток", "Храйме", "Хреновина", "Худар", "Хумус", "Хуплу",
                "Хушур", "Хычин", "Хэш", "Царникавская минога", "Цаца", "Цветки тыкв", "Цвикли", "Цебуляж", "Цезарь",
                "Цеппелины", "Цзунцзы", "Цзяоцзы", "Цимес", "Цкен", "Цуйван", "Цукаты", "Цукер-леках",
                "Цыплёнок табака", "Чай", "Чак-чак", "Чакапули", "Чанахи", "Чапати", "Чатни", "Чаудер", "Чахохбили",
                "Чебурек", "Чевапчичи", "Челоу-кебаб", "Чепалгаш", "Чиг-кёфте", "Чизбургер", "Чизкейк", "Чилакилес",
                "Чили кон карне", "Чили кон кесо", "Чилиндрон", "Чимичурри", "Чиновничья подлива", "Чипа", "Чиполата",
                "Чихиртма", "Чичаррон", "Чолнт", "Чонбокчук", "Чонголь", "Чоппино", "Чорба", "Чоризо", "Чуду",
                "Чучвара", "Ччигэ", "Чыгыртма", "Чыз-быз", "Чылбыр", "Шакер-чурек", "Шаккар-пара", "Шакотис", "Шаньга",
                "Шаобин", "Шарлотка", "Шароц", "Шатобриан", "Шаурма", "Шашлык", "Шварцвальдская ветчина",
                "Шведские фрикадельки", "Швенкбратен", "Шекербура", "Шербет", "Ширден", "Ширтан", "Шифоновый бисквит",
                "Шкварки", "Шкедей марак", "Шкмерули", "Шницель", "Шницель по-гольштейнски", "Шоколадные шарики",
                "Шоколатин", "Шопский салат", "Шпикачка", "Шпревальдские огурцы", "Шпрингерле", "Шпундра", "Штоллен",
                "Штрамберкские уши", "Штрицель", "Штрудель", "Шукрут", "Шупеня", "Шурпа", "Шурпе", "Щербет", "Щи",
                "Ынджера", "Эдамамэ", "Эклер", "Эларджи", "Эмпанада", "Энсаймада", "Энчилада", "Эскабече", "Эскалоп",
                "Эскимо", "Эскуделья", "Эспаньоль", "Эчпочмак", "Юварлакиа", "Югатерт", "Юдзукосё", "Юдофу",
                "Юражная каша", "Яблочное пюре", "Яблочный хрен", "Яичница", "Яичное масло", "Яичный тарт",
                "Яйца Бенедикт", "Яйца в горчичном соусе", "Яйцо пашот", "Яйцо по-шотландски", "Якитори", "Яксик",
                "Японское карри", "Ятернице", "Яхния", "Яцухаси", "Ячневая каша"
            };

            var ordersCount = db.Orders.Count();

            for (var orderId = 1; orderId <= ordersCount; orderId++)
            {
                var count = Random.Next(1, 10);
                for (var j = 0; j < count; j++)
                    db.Add(new Dish
                    {
                        Name = names[Random.Next(names.Length)],
                        Cost = (Random.NextDouble() + 0.01) * 150.0,
                        CookingTime = Random.Next(1, 300),
                        OrderId = orderId
                    });
            }

            db.SaveChanges();
        }

        private static void GenerateDishIngredients(RestarauntDbContext db)
        {
            if (db.DishIngredients.Any()) return;

            var dishesCount = db.Dishes.Count();
            var ingredientsCount = db.Ingredients.Count();

            for (var dishId = 1; dishId <= dishesCount; dishId++)
            {
                var dishIngredients = Random.Next(1, 7);
                for (var i = 0; i < dishIngredients; i++)
                    db.DishIngredients.Add(new DishIngredient
                    {
                        Count = Random.Next(1, 10),
                        DishId = dishId,
                        IngredientId = Random.Next(1, ingredientsCount)
                    });
            }

            db.SaveChanges();
        }

        private static DateTime GenerateRandomDate()
        {
            var start = new DateTime(2016, 1, 1);
            var range = (DateTime.Today - start).Days;
            return start.AddDays(Random.Next(range));
        }
    }
}